//*******************************************************************************************************************************************
//
// ダイナマイトアリーナ(Guid.cpp)
// Author : Kasai Keisuke
//
//*******************************************************************************************************************************************

// include
#include "Guid.h"

//*******************************************************************************************************************************************
// コンストラクタ
//*******************************************************************************************************************************************
CGuid::CGuid(int nPriority):CObject2D(nPriority)
{
	m_pTexture = nullptr;					// テクスチャのポインタ
	m_Type = TEXTURETYPE::TYPE_NONE;		// テクスチャの種類
	m_bAnimation = false;					// アニメーション用フラグ(trueの時にα値を上げる)

}

//*******************************************************************************************************************************************
// デストラクタ
//*******************************************************************************************************************************************
CGuid::~CGuid()
{
	m_pTexture = nullptr;					// テクスチャのポインタ
	m_Type = TEXTURETYPE::TYPE_NONE;		// テクスチャの種類
	m_bAnimation = false;					// アニメーション用フラグ(trueの時にα値を上げる)

}

//*******************************************************************************************************************************************
// 初期化処理
//*******************************************************************************************************************************************
HRESULT CGuid::Init()
{
	// 2Dオブジェクトの初期化処理
	CObject2D::Init();

	return S_OK;
}

//*******************************************************************************************************************************************
// 終了処理
//*******************************************************************************************************************************************
void CGuid::Uninit()
{
	// 2Dオブジェクトの終了処理
	CObject2D::Uninit();

	Release();
}

//*******************************************************************************************************************************************
// 更新処理
//*******************************************************************************************************************************************
void CGuid::Update()
{
	if (m_Type == TEXTURETYPE::TYPE_RETURNTITLE)
	{// タイトルに戻るテクスチャの場合

		// アニメーション処理
		Animation();
	}

	// 2Dオブジェクトの更新処理
	CObject2D::Update();
}

//*******************************************************************************************************************************************
// 描画処理
//*******************************************************************************************************************************************
void CGuid::Draw()
{
	// 2Dオブジェクトの描画処理
	CObject2D::Draw();
}

//*******************************************************************************************************************************************
// 生成処理
//*******************************************************************************************************************************************
CGuid* CGuid::Create(D3DXVECTOR3 pos, float fWidth, float fHeight, TEXTURETYPE type)
{
	// シングルトンインスタンスの取得
	CManager& manager = CManager::GetInstance();

	CGuid* pGuid = new CGuid();

	pGuid->Init();		// 初期化処理

	pGuid->SetObject2D(pos, D3DXCOLOR(1.0f, 1.0f, 1.0f, 1.0f), fWidth, fHeight);		// 情報設定

	switch (type)
	{// テクスチャの読み込み
	case TEXTURETYPE::TYPE_STARTGAME:

		D3DXCreateTextureFromFile(manager.GetRenderer()->GetDevice(), "data\\TEXTURE\\guid000.png", &pGuid->m_pTexture);

		break;
	case TEXTURETYPE::TYPE_RETURNTITLE:

		D3DXCreateTextureFromFile(manager.GetRenderer()->GetDevice(), "data\\TEXTURE\\guid001.png", &pGuid->m_pTexture);

		break;
	}

	// テクスチャの設定
	pGuid->BindTexture(pGuid->m_pTexture);

	pGuid->m_Type = type;	// 種類設定

	return pGuid;
}

//*******************************************************************************************************************************************
// アニメーション処理
//*******************************************************************************************************************************************
void CGuid::Animation()
{
	D3DXCOLOR CurrentColor = GetColor();

	if (CurrentColor.a <= MIN_POLYGONCOLOR)
	{
		m_bAnimation = true;
	}
	if (CurrentColor.a >= 1.0f)
	{
		m_bAnimation = false;
	}

	if (m_bAnimation)
	{
		CurrentColor.a += POLYGONANIM_SPEED;
	}
	else if (!m_bAnimation)
	{
		CurrentColor.a -= POLYGONANIM_SPEED;
	}

	SetColor(CurrentColor);

}
